from  django.http import HttpResponse 

def home(request):
    return HttpResponse ("""
    <h1> Главная страница магазина - Green Burn <h1/>
    <h3> Ссылки: <h3/>
    <a href = "/about/"> О магазине <a/><br>
    <a href = "/author/"> Об авторе <a/><br>                    
    """)

def about(request):
    return HttpResponse ("""
  О магазине Green Burn:
  🌿 Green Burn — флористика и сувениры с душой
  Мы — минский магазин для тех, кто создаёт красоту. В Green Burn вы найдёте всё для флористики: горшки, кашпо, ленты, пленку, сухоцветы, упаковку и материалы от проверенных брендов. А ещё — тёплые, продуманные сувениры: шкатулки, фоторамки, подсвечники, интерьерные часы и подарки на любой повод.
✅ Прямые поставки — честные цены
✅ Доставка по всей Беларуси
✅ Опт для флористов, студий и бизнеса
✅ Только качественные и эстетичные товары
  Большинство наших клиентов возвращаются снова — потому что здесь легко найти то, что вдохновляет.
🌱 Green Burn — где растёт хорошее настроение.
    """)

def author(request):
  return HttpResponse ("""
  Меня зовут Данила Тихонович, и я — создатель Green Burn.
  Этот магазин родился из любви к живым растениям, уюту и деталям, которые делают подарок по-настоящему личным. Я лично подбираю каждый товар — от флористических материалов до интерьерных сувениров — чтобы вы могли создавать, дарить и украшать с уверенностью и вдохновением.
  Green Burn — это не просто каталог. Это место, где встречаются красота, качество и забота. Спасибо, что вы с нами!
  """)